const dataList = {
  "chapter" : [
    {
      "name" : "第一章：雀食奇谭(普通)",
      "monster" : [
        {
          "name" : "妖怪1(天邪鬼绿)" ,
          "detail" : {
            "天邪鬼绿" : 1,
            "灯笼鬼" : 2
          }
        }
      ]
    },
    {
      "name" : "第一章：雀食奇谭(困难)",
      "monster" : [
        {
          "name" : "妖怪1(天邪鬼绿)" ,
          "detail" : {
            "天邪鬼绿" : 1,
            "跳跳犬" : 2
          }
        }
      ]
    },
    {
      "name" : "第一章：雀食奇谭",
      "monster" : [
        {
          "name" : "妖怪2(天邪鬼绿)" ,
          "detail" : {
            "天邪鬼绿" : 1,
            "提灯小僧" : 2
          }
        },
        {
          "name" : "妖怪3(提灯小僧)" ,
          "detail" : {
            "天邪鬼绿" : 2,
            "提灯小僧" : 1
          }
        },
        {
          "name" : "妖怪4(提灯小僧)" ,
          "detail" : {
            "灯笼鬼" : 2,
            "提灯小僧" : 1
          }
        },
        {
          "name" : "BOSS(九命猫)" ,
          "detail" : {
            "九命猫" : 3
          }
        }
      ]
    },
    {
      "name" : "第二章：幸福的彼岸",
      "monster" : [
        {
          "name" : "妖怪1(帚神)" ,
          "detail" : {
            "帚神" : 1,
            "寄生魂" : 1,
            "盗墓小鬼" : 1
          }
        },
        {
          "name" : "妖怪2(盗墓小鬼)" ,
          "detail" : {
            "寄生魂" : 2,
            "盗墓小鬼" : 1
          }
        },
        {
          "name" : "妖怪3(盗墓小鬼)" ,
          "detail" : {
            "灯笼鬼" : 2,
            "盗墓小鬼" : 1
          }
        },
        {
          "name" : "妖怪4(寄生魂)" ,
          "detail" : {
            "灯笼鬼" : 2,
            "寄生魂" : 1
          }
        },
        {
          "name" : "妖怪5(寄生魂)" ,
          "detail" : {
            "盗墓小鬼" : 2,
            "寄生魂" : 1
          }
        },
        {
          "name" : "BOSS(座敷童子)" ,
          "detail" : {
            "座敷童子" : 1,
            "天邪鬼绿" : 2,
            "天邪鬼青" : 1
          }
        }
      ]
    },
    {
      "name" : "第三章：凤凰林的占卜师(普通)",
      "monster" : [
        {
          "name" : "妖怪3(兵俑)" ,
          "detail" : {
            "兵俑" : 1,
            "提灯小僧" : 1,
            "童女" : 2
          }
        }
      ]
    },
    {
      "name" : "第三章：凤凰林的占卜师(困难)",
      "monster" : [
        {
          "name" : "妖怪3(兵俑)" ,
          "detail" : {
            "兵俑" : 1,
            "提灯小僧" : 2,
            "童女" : 1
          }
        }
      ]
    },
    {
      "name" : "第三章：凤凰林的占卜师",
      "monster" : [
        {
          "name" : "妖怪1(天邪鬼黄)" ,
          "detail" : {
            "天邪鬼黄" : 1,
            "帚神" : 2,
            "涂壁" : 1
          }
        },
        {
          "name" : "妖怪2(赤舌)" ,
          "detail" : {
            "赤舌" : 1,
            "提灯小僧" : 1,
            "灯笼鬼" : 2,
            "鸦天狗" : 1
          }
        },
        {
          "name" : "妖怪4(兵俑)" ,
          "detail" : {
            "兵俑" : 1,
            "提灯小僧" : 1,
            "灯笼鬼" : 2
          }
        },
        {
          "name" : "妖怪5(赤舌)" ,
          "detail" : {
            "赤舌" : 1,
            "天邪鬼黄" : 1,
            "童女" : 2,
            "鸦天狗" : 1
          }
        },
        {
          "name" : "妖怪6(天邪鬼黄)" ,
          "detail" : {
            "天邪鬼黄" : 1,
            "童女" : 3
          }
        },
        {
          "name" : "BOSS(凤凰火)" ,
          "detail" : {
            "凤凰火" : 1,
            "寄生魂" : 3
          }
        }
      ]
    },
    {
      "name" : "第四章：桥上的雨女(普通)",
      "monster" : [
        {
          "name" : "妖怪2(帚神)" ,
          "detail" : {
            "帚神" : 1,
            "涂壁" : 1,
            "唐纸伞妖" : 2
          }
        },
        {
          "name" : "妖怪4(唐纸伞妖)" ,
          "detail" : {
            "唐纸伞妖" : 1,
            "天邪鬼赤" : 1,
            "涂壁" : 2
          }
        }
      ]
    },
    {
      "name" : "第四章：桥上的雨女(困难)",
      "monster" : [
        {
          "name" : "妖怪2(帚神)" ,
          "detail" : {
            "帚神" : 1,
            "唐纸伞妖" : 3
          }
        },
        {
          "name" : "妖怪4(唐纸伞妖)" ,
          "detail" : {
            "唐纸伞妖" : 1,
            "涂壁" : 3
          }
        }
      ]
    },
    {
      "name" : "第四章：桥上的雨女",
      "monster" : [
        {
          "name" : "妖怪1(帚神)" ,
          "detail" : {
            "帚神" : 1,
            "涂壁" : 2
          }
        },
        {
          "name" : "妖怪3(唐纸伞妖)" ,
          "detail" : {
            "唐纸伞妖" : 1,
            "天邪鬼赤" : 3
          }
        },
        {
          "name" : "妖怪5(天邪鬼赤)" ,
          "detail" : {
            "天邪鬼赤" : 1,
            "唐纸伞妖" : 1,
            "涂壁" : 2
          }
        },
        {
          "name" : "妖怪6(天邪鬼赤)" ,
          "detail" : {
            "天邪鬼赤" : 1,
            "唐纸伞妖" : 2
          }
        },
        {
          "name" : "BOSS(雨女)" ,
          "detail" : {
            "雨女" : 1,
            "青蛙瓷器" : 1,
            "帚神" : 2
          }
        }
      ]
    },
    {
      "name" : "第五章：黑夜山的食发鬼(普通)",
      "monster" : [
        {
          "name" : "妖怪1(涂壁)" ,
          "detail" : {
            "涂壁" : 1,
            "天邪鬼赤" : 2,
            "黑豹" : 1
          }
        }
      ]
    },
    {
      "name" : "第五章：黑夜山的食发鬼(困难)",
      "monster" : [
        {
          "name" : "妖怪1(涂壁)" ,
          "detail" : {
            "涂壁" : 2,
            "天邪鬼赤" : 2
          }
        }
      ]
    },
    {
      "name" : "第五章：黑夜山的食发鬼",
      "monster" : [
        {
          "name" : "妖怪2(涂壁)" ,
          "detail" : {
            "涂壁" : 1,
            "天邪鬼赤" : 3
          }
        },
        {
          "name" : "妖怪3(帚神)" ,
          "detail" : {
            "帚神" : 1,
            "天邪鬼赤" : 1,
            "涂壁" : 2
          }
        },
        {
          "name" : "妖怪4(帚神)" ,
          "detail" : {
            "帚神" : 1,
            "天邪鬼赤" : 1,
            "天邪鬼黄" : 2
          }
        },
        {
          "name" : "妖怪5(管狐)" ,
          "detail" : {
            "管狐" : 2,
            "天邪鬼黄" : 2,
            "寄生魂" : 1
          }
        },
        {
          "name" : "妖怪6(管狐)" ,
          "detail" : {
            "管狐" : 1,
            "天邪鬼绿" : 3,
            "寄生魂" : 1
          }
        },
        {
          "name" : "BOSS(食发鬼)" ,
          "detail" : {
            "食发鬼" : 1,
            "灯笼鬼" : 1,
            "天邪鬼青" : 2
          }
        }
      ]
    },
    {
      "name" : "第六章：似梦非梦",
      "monster" : [
        {
          "name" : "妖怪1(灯笼鬼)" ,
          "detail" : {
            "灯笼鬼" : 1,
            "帚神" : 3
          }
        },
        {
          "name" : "妖怪2(灯笼鬼)" ,
          "detail" : {
            "灯笼鬼" : 1,
            "帚神" : 3
          }
        },
        {
          "name" : "妖怪3(天邪鬼青)" ,
          "detail" : {
            "天邪鬼青" : 1,
            "天邪鬼绿" : 3
          }
        },
        {
          "name" : "妖怪4(天邪鬼青)" ,
          "detail" : {
            "天邪鬼青" : 1,
            "天邪鬼绿" : 3
          }
        },
        {
          "name" : "妖怪5(蝴蝶精)" ,
          "detail" : {
            "蝴蝶精" : 1,
            "涂壁" : 1,
            "天邪鬼赤" : 2,
            "三尾狐" : 1
          }
        },
        {
          "name" : "妖怪6(蝴蝶精)" ,
          "detail" : {
            "蝴蝶精" : 1,
            "涂壁" : 1,
            "天邪鬼赤" : 2,
            "三尾狐" : 1
          }
        },
        {
          "name" : "BOSS(巫蛊师)" ,
          "detail" : {
            "巫蛊师" : 1,
            "天邪鬼绿" : 3
          }
        }
      ]
    },
    {
      "name" : "第七章：恋上鲤的美",
      "monster" : [
        {
          "name" : "妖怪1(鲤鱼精)" ,
          "detail" : {
            "鲤鱼精" : 3,
            "帚神" : 1
          }
        },
        {
          "name" : "妖怪2(鲤鱼精)" ,
          "detail" : {
            "鲤鱼精" : 1,
            "帚神" : 3
          }
        },
        {
          "name" : "妖怪3(河童)" ,
          "detail" : {
            "河童" : 1,
            "鲤鱼精" : 1,
            "涂壁" : 2
          }
        },
        {
          "name" : "妖怪4(提灯小僧)" ,
          "detail" : {
            "提灯小僧" : 1,
            "跳跳犬" : 3,
            "管狐" : 1
          }
        },
        {
          "name" : "妖怪5(提灯小僧)" ,
          "detail" : {
            "提灯小僧" : 1,
            "跳跳犬" : 3,
            "管狐" : 1
          }
        },
        {
          "name" : "妖怪6(提灯小僧)" ,
          "detail" : {
            "提灯小僧" : 1,
            "跳跳犬" : 1,
            "鲤鱼精" : 2,
            "管狐" : 1
          }
        },
        {
          "name" : "妖怪7(河童)" ,
          "detail" : {
            "河童" : 1,
            "灯笼鬼" : 1,
            "跳跳犬" : 2
          }
        },
        {
          "name" : "BOSS(妖狐)" ,
          "detail" : {
            "妖狐" : 2,
            "涂壁" : 1,
            "座敷童子" : 2,
            "天邪鬼赤" : 2,
            "寄生魂" : 1
          }
        }
      ]
    },
    {
      "name" : "第八章：樱与桃",
      "monster" : [
        {
          "name" : "妖怪1(天邪鬼绿)" ,
          "detail" : {
            "天邪鬼绿" : 1,
            "天邪鬼青" : 1,
            "天邪鬼黄" : 2
          }
        },
        {
          "name" : "妖怪2(樱花妖)" ,
          "detail" : {
            "樱花妖" : 1,
            "帚神" : 1,
            "涂壁" : 2,
            "雪女" : 1
          }
        },
        {
          "name" : "妖怪3(唐纸伞妖)" ,
          "detail" : {
            "唐纸伞妖" : 1,
            "帚神" : 3
          }
        },
        {
          "name" : "妖怪4(天邪鬼绿)" ,
          "detail" : {
            "天邪鬼绿" : 1,
            "天邪鬼青" : 1,
            "天邪鬼黄" : 2
          }
        },
        {
          "name" : "妖怪5(唐纸伞妖)" ,
          "detail" : {
            "唐纸伞妖" : 1,
            "山童" : 1,
            "帚神" : 2
          }
        },
        {
          "name" : "妖怪6(樱花妖)" ,
          "detail" : {
            "樱花妖" : 1,
            "涂壁" : 3,
            "雪女" : 1
          }
        },
        {
          "name" : "BOSS(桃花妖)" ,
          "detail" : {
            "桃花妖" : 1,
            "天邪鬼青" : 1,
            "提灯小僧" : 2,
            "樱花妖" : 1,
            "帚神" : 1,
            "蝴蝶精" : 2
          }
        }
      ]
    },
    {
      "name" : "第九章：兔龟茶和锅",
      "monster" : [
        {
          "name" : "妖怪1(提灯小僧)" ,
          "detail" : {
            "提灯小僧" : 1,
            "灯笼鬼" : 3
          }
        },
        {
          "name" : "妖怪2(铁鼠)" ,
          "detail" : {
            "铁鼠" : 1,
            "帚神" : 3
          }
        },
        {
          "name" : "妖怪3(提灯小僧)" ,
          "detail" : {
            "提灯小僧" : 1,
            "灯笼鬼" : 1,
            "铁鼠" : 2
          }
        },
        {
          "name" : "妖怪4(山兔)" ,
          "detail" : {
            "山兔" : 4,
            "鸦天狗" : 1
          }
        },
        {
          "name" : "妖怪5(山兔)" ,
          "detail" : {
            "山兔" : 3,
            "铁鼠" : 1,
            "鸦天狗" : 1
          }
        },
        {
          "name" : "妖怪6(铁鼠)" ,
          "detail" : {
            "铁鼠" : 2,
            "帚神" : 2
          }
        },
        {
          "name" : "BOSS(孟婆)" ,
          "detail" : {
            "孟婆" : 2,
            "饿鬼" : 3,
            "灯笼鬼" : 1,
            "鸦天狗" : 2
          }
        }
      ]
    },
    {
      "name" : "第十章：鬼为谁买醉",
      "monster" : [
        {
          "name" : "妖怪1(丑时之女)" ,
          "detail" : {
            "丑时之女" : 1,
            "傀儡师" : 1,
            "天邪鬼青" : 2
          }
        },
        {
          "name" : "妖怪2(丑时之女)" ,
          "detail" : {
            "丑时之女" : 1,
            "傀儡师" : 1,
            "天邪鬼青" : 2
          }
        },
        {
          "name" : "妖怪3(觉)" ,
          "detail" : {
            "觉" : 1,
            "狸猫" : 3
          }
        },
        {
          "name" : "妖怪4(傀儡师)" ,
          "detail" : {
            "傀儡师" : 1,
            "觉" : 1,
            "狸猫" : 2
          }
        },
        {
          "name" : "妖怪5(觉)" ,
          "detail" : {
            "觉" : 1,
            "赤舌" : 1,
            "座敷童子" : 2,
            "犬神" : 1
          }
        },
        {
          "name" : "妖怪6(傀儡师)" ,
          "detail" : {
            "傀儡师" : 1,
            "觉" : 1,
            "座敷童子" : 2,
            "犬神" : 1
          }
        },
        {
          "name" : "BOSS(酒吞童子)" ,
          "detail" : {
            "酒吞童子" : 2,
            "跳跳哥哥" : 1,
            "食发鬼" : 2,
            "兵俑" : 1,
            "骨女" : 2
          }
        }
      ]
    },
    {
      "name" : "第十一章：染红了的枫叶林(普通)",
      "monster" : [
        {
          "name" : "妖怪3(独眼小僧)" ,
          "detail" : {
            "独眼小僧" : 1,
            "涂壁" : 1,
            "天邪鬼赤" : 2
          }
        },
        {
          "name" : "妖怪4(独眼小僧)" ,
          "detail" : {
            "独眼小僧" : 1,
            "管狐" : 1,
            "天邪鬼赤" : 2
          }
        }
      ]
    },
    {
      "name" : "第十一章：染红了的枫叶林(困难)",
      "monster" : [
        {
          "name" : "妖怪3(独眼小僧)" ,
          "detail" : {
            "独眼小僧" : 2,
            "涂壁" : 1,
            "天邪鬼赤" : 2
          }
        },
        {
          "name" : "妖怪4(独眼小僧)" ,
          "detail" : {
            "独眼小僧" : 2,
            "管狐" : 1,
            "天邪鬼赤" : 2
          }
        }
      ]
    },
    {
      "name" : "第十一章：染红了的枫叶林",
      "monster" : [
        {
          "name" : "妖怪1(武士之灵)" ,
          "detail" : {
            "武士之灵" : 1,
            "寄生魂" : 3
          }
        },
        {
          "name" : "妖怪2(武士之灵)" ,
          "detail" : {
            "武士之灵" : 1,
            "独眼小僧" : 3
          }
        },
        {
          "name" : "妖怪5(饿鬼)" ,
          "detail" : {
            "饿鬼" : 1,
            "涂壁" : 1,
            "管狐" : 2
          }
        },
        {
          "name" : "妖怪6(饿鬼)" ,
          "detail" : {
            "饿鬼" : 3,
            "管狐" : 1
          }
        },
        {
          "name" : "BOSS(鬼女红叶)" ,
          "detail" : {
            "鬼女红叶" : 2,
            "童女" : 1,
            "天邪鬼青" : 2,
            "骨女" : 1,
            "觉" : 2
          }
        }
      ]
    },
    {
      "name" : "第十二章：另一个晴明",
      "monster" : [
        {
          "name" : "妖怪1(海坊主)" ,
          "detail" : {
            "海坊主" : 1,
            "帚神" : 1,
            "涂壁" : 2
          }
        },
        {
          "name" : "妖怪2(海坊主)" ,
          "detail" : {
            "海坊主" : 1,
            "涂壁" : 1,
            "鸦天狗" : 2
          }
        },
        {
          "name" : "妖怪3(童女)" ,
          "detail" : {
            "童女" : 1,
            "盗墓小鬼" : 1,
            "提灯小僧" : 2,
            "雪女" : 1
          }
        },
        {
          "name" : "妖怪4(童男)" ,
          "detail" : {
            "童男" : 1,
            "天邪鬼黄" : 1,
            "鸦天狗" : 2
          }
        },
        {
          "name" : "妖怪5(童男)" ,
          "detail" : {
            "童男" : 1,
            "童女" : 1,
            "鸦天狗" : 2
          }
        },
        {
          "name" : "妖怪6(童女)" ,
          "detail" : {
            "童女" : 3,
            "盗墓小鬼" : 1,
            "雪女" : 1
          }
        },
        {
          "name" : "BOSS(雪女)" ,
          "detail" : {
            "雪女" : 2,
            "寄生魂" : 1,
            "武士之灵" : 2,
            "跳跳妹妹" : 1,
            "跳跳哥哥" : 2
          }
        }
      ]
    },
    {
      "name" : "第十三章：箭与弓道",
      "monster" : [
        {
          "name" : "妖怪1(饿鬼)" ,
          "detail" : {
            "饿鬼" : 1,
            "天邪鬼赤" : 3
          }
        },
        {
          "name" : "妖怪2(饿鬼)" ,
          "detail" : {
            "饿鬼" : 1,
            "天邪鬼赤" : 3
          }
        },
        {
          "name" : "妖怪3(唐纸伞妖)" ,
          "detail" : {
            "唐纸伞妖" : 1,
            "天邪鬼赤" : 1,
            "天邪鬼绿" : 2
          }
        },
        {
          "name" : "妖怪4(唐纸伞妖)" ,
          "detail" : {
            "唐纸伞妖" : 1,
            "天邪鬼赤" : 1,
            "天邪鬼绿" : 2
          }
        },
        {
          "name" : "妖怪5(饿鬼)" ,
          "detail" : {
            "饿鬼" : 1,
            "天邪鬼赤" : 3,
            "首无" : 1
          }
        },
        {
          "name" : "妖怪6(唐纸伞妖)" ,
          "detail" : {
            "唐纸伞妖" : 1,
            "天邪鬼赤" : 1,
            "天邪鬼绿" : 2,
            "首无" : 1
          }
        },
        {
          "name" : "BOSS(首无)" ,
          "detail" : {
            "首无" : 1,
            "骨女" : 1,
            "灯笼鬼" : 1,
            "山兔" : 1
          }
        }
      ]
    },
    {
      "name" : "第二十一章：七角山秘闻",
      "monster" : [
        {
          "name" : "妖怪1(烟烟罗)" ,
          "detail" : {
            "武士之灵" : 3,
            "烟烟罗" : 1
          }
        },
        {
          "name" : "妖怪2(食发鬼)" ,
          "detail" : {
            "丑时之女" : 3,
            "食发鬼" : 1
          }
        },
        {
          "name" : "妖怪3(烟烟罗)" ,
          "detail" : {
            "武士之灵" : 2,
            "兵俑" : 1,
            "烟烟罗" : 1
          }
        },
        {
          "name" : "妖怪4(食发鬼)" ,
          "detail" : {
            "丑时之女" : 2,
            "兵俑" : 1,
            "食发鬼" : 1
          }
        },
        {
          "name" : "妖怪5(吸血姬)" ,
          "detail" : {
            "跳跳弟弟" : 3,
            "吸血姬" : 1,
            "夜叉" : 1
          }
        },
        {
          "name" : "妖怪6(食发鬼)" ,
          "detail" : {
            "丑时之女" : 2,
            "兵俑" : 1,
            "食发鬼" : 1
          }
        },
        {
          "name" : "妖怪7(吸血姬)" ,
          "detail" : {
            "跳跳弟弟" : 2,
            "武士之灵" : 1,
            "吸血姬" : 1,
            "夜叉" : 1
          }
        },
        {
          "name" : "BOSS(萤草)" ,
          "detail" : {
            "烟烟罗" : 4,
            "吸血姬" : 2,
            "萤草" : 2
          }
        }
      ]
    },
    {
      "name" : "第二十二章：八岐大蛇的秘谋",
      "monster" : [
        {
          "name" : "妖怪1(络新妇)" ,
          "detail" : {
            "络新妇" : 1,
            "般若" : 1,
            "烟烟罗" : 2
          }
        },
        {
          "name" : "妖怪2(二口女)" ,
          "detail" : {
            "二口女" : 3,
            "烟烟罗" : 1,
            "络新妇" : 1
          }
        },
        {
          "name" : "妖怪3(青坊主)" ,
          "detail" : {
            "二口女" : 2,
            "烟烟罗" : 1,
            "青坊主" : 1
          }
        },
        {
          "name" : "妖怪4(青坊主)" ,
          "detail" : {
            "般若" : 3,
            "青坊主" : 1
          }
        },
        {
          "name" : "妖怪5(二口女)" ,
          "detail" : {
            "二口女" : 2,
            "烟烟罗" : 2,
            "青坊主" : 1
          }
        },
        {
          "name" : "妖怪6(络新妇)" ,
          "detail" : {
            "二口女" : 1,
            "烟烟罗" : 2,
            "络新妇" : 1
          }
        },
        {
          "name" : "妖怪7(络新妇)" ,
          "detail" : {
            "二口女" : 3,
            "络新妇" : 1,
            "夜叉" : 1
          }
        },
        {
          "name" : "BOSS(络新妇)" ,
          "detail" : {
            "二口女" : 2,
            "般若" : 1,
            "酒吞童子" : 1,
            "椒图" : 1,
            "吸血姬" : 1,
            "惠比寿" : 1,
            "络新妇" : 1
          }
        }
      ]
    },
    {
      "name" : "第二十三章：沉睡的傀儡师",
      "monster" : [
        {
          "name" : "妖怪1(孟婆)" ,
          "detail" : {
            "山兔" : 3,
            "孟婆" : 1
          }
        },
        {
          "name" : "妖怪2(盗墓小鬼)" ,
          "detail" : {
            "座敷童子" : 2,
            "河童" : 1,
            "盗墓小鬼" : 1
          }
        },
        {
          "name" : "妖怪3(孟婆)" ,
          "detail" : {
            "山兔" : 3,
            "孟婆" : 1
          }
        },
        {
          "name" : "妖怪4(骨女)" ,
          "detail" : {
            "赤舌" : 3,
            "骨女" : 1
          }
        },
        {
          "name" : "妖怪5(盗墓小鬼)" ,
          "detail" : {
            "座敷童子" : 2,
            "河童" : 1,
            "盗墓小鬼" : 1
          }
        },
        {
          "name" : "妖怪6(孟婆)" ,
          "detail" : {
            "山兔" : 3,
            "孟婆" : 1
          }
        },
        {
          "name" : "妖怪7(骨女)" ,
          "detail" : {
            "赤舌" : 3,
            "骨女" : 1
          }
        },
        {
          "name" : "BOSS(傀儡师)" ,
          "detail" : {
            "盗墓小鬼" : 3,
            "萤草" : 3,
            "傀儡师" : 2
          }
        }
      ]
    },
    {
      "name" : "第二十四章：祭品巫女·前篇",
      "monster" : [
        {
          "name" : "妖怪1(络新妇)" ,
          "detail" : {
            "跳跳哥哥" : 3,
            "络新妇" : 1
          }
        },
        {
          "name" : "妖怪2(清姬)" ,
          "detail" : {
            "鬼使黑" : 2,
            "鬼使白" : 1,
            "清姬" : 1
          }
        },
        {
          "name" : "妖怪3(吸血姬)" ,
          "detail" : {
            "海坊主" : 3,
            "吸血姬" : 1
          }
        },
        {
          "name" : "妖怪4(清姬)" ,
          "detail" : {
            "鬼使黑" : 2,
            "鬼使白" : 1,
            "清姬" : 1
          }
        },
        {
          "name" : "妖怪5(吸血姬)" ,
          "detail" : {
            "海坊主" : 3,
            "吸血姬" : 1
          }
        },
        {
          "name" : "妖怪6(清姬)" ,
          "detail" : {
            "鬼使黑" : 2,
            "鬼使白" : 1,
            "清姬" : 1
          }
        },
        {
          "name" : "妖怪7(络新妇)" ,
          "detail" : {
            "跳跳哥哥" : 3,
            "络新妇" : 1
          }
        },
        {
          "name" : "BOSS(清姬)" ,
          "detail" : {
            "骨女" : 1,
            "络新妇" : 1,
            "鬼使白" : 1,
            "清姬" : 1
          }
        }
      ]
    }
  ],
  "yuhun" : [
    {
      "name" : "御魂壹层",
      "monster" : [
        {
          "detail" : {
            "天邪鬼青" : 1,
            "三尾狐" : 1,
            "天邪鬼黄" : 1,
            "涂壁" : 1,
            "山童" : 1,
            "独眼小僧" : 1,
            "天邪鬼赤" : 2
          }
        }
      ]
    },
    {
      "name" : "御魂贰层",
      "monster" : [
        {
          "detail" : {
            "鲤鱼精" : 1,
            "妖狐" : 1,
            "河童" : 1,
            "萤草" : 1,
            "吸血姬" : 1,
            "兵俑" : 1,
            "童女" : 2
          }
        }
      ]
    },
    {
      "name" : "御魂叁层",
      "monster" : [
        {
          "detail" : {
            "桃花妖" : 1,
            "蝴蝶精" : 1,
            "青蛙瓷器" : 1,
            "海坊主" : 1,
            "鲤鱼精" : 1,
            "椒图" : 1,
            "座敷童子" : 2
          }
        }
      ]
    },
    {
      "name" : "御魂肆层",
      "monster" : [
        {
          "detail" : {
            "犬神" : 1,
            "童男" : 1,
            "童女" : 1,
            "大天狗" : 1,
            "鬼使黑" : 1,
            "鬼使白" : 1,
            "食梦貘" : 2
          }
        }
      ]
    },
    {
      "name" : "御魂伍层",
      "monster" : [
        {
          "detail" : {
            "镰鼬" : 1,
            "骨女" : 1,
            "丑时之女" : 1,
            "傀儡师" : 1,
            "跳跳哥哥" : 1,
            "独眼小僧" : 1,
            "孟婆" : 2
          }
        }
      ]
    },
    {
      "name" : "御魂陆层",
      "monster" : [
        {
          "detail" : {
            "雨女" : 1,
            "孟婆" : 1,
            "座敷童子" : 1,
            "阎魔" : 1,
            "巫蛊师" : 1,
            "鸦天狗" : 1,
            "骨女" : 2
          }
        }
      ]
    },
    {
      "name" : "御魂柒层",
      "monster" : [
        {
          "detail" : {
            "凤凰火" : 1,
            "食发鬼" : 1,
            "丑时之女" : 1,
            "酒吞童子" : 1,
            "妖琴师" : 1,
            "山兔" : 1,
            "荒川之主" : 2
          }
        }
      ]
    },
    {
      "name" : "御魂捌层",
      "monster" : [
        {
          "detail" : {
            "饿鬼" : 1,
            "管狐" : 1,
            "判官" : 1,
            "蝴蝶精" : 1,
            "椒图" : 1,
            "白狼" : 1,
            "茨木童子" : 2
          }
        }
      ]
    },
    {
      "name" : "御魂玖层",
      "monster" : [
        {
          "detail" : {
            "椒图" : 1,
            "鲤鱼精" : 1,
            "萤草" : 1,
            "食梦貘" : 1,
            "狸猫" : 1,
            "清姬" : 1,
            "两面佛" : 2
          }
        }
      ]
    },
    {
      "name" : "御魂拾层",
      "monster" : [
        {
          "detail" : {
            "二口女" : 1,
            "觉" : 1,
            "萤草" : 1,
            "椒图" : 1,
            "青行灯" : 1,
            "酒吞童子" : 1,
            "大天狗" : 2
          }
        }
      ]
    },
    {
      "name" : "业原火",
      "monster" : [
        {
          "detail" : {
            "萤草" : 4,
            "妖狐" : 1,
            "蝴蝶精" : 1,
            "兵俑" : 1,
            "三尾狐" : 1,
            "椒图" : 1
          }
        }
      ]
    }
  ]
}
// 导出模块
module.exports = dataList